DataProcessors/атл_ОбменСообщениями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ОбменСообщениями</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Промежуток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Полученное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторИнформационнойБазы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрочтения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучательМК</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправительМК</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Административное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСсылкаНаОбъект</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщенияНаЭкране</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>21</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выведено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбновитьСтатус</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/атл_ОбменСообщениями/Forms/ИнформацияОСообщении/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	мВыгрузка = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	Объект.ТаблицаСообщений.Загрузить(мВыгрузка);	
	МассивСообщений = Объект.ТаблицаСообщений.НайтиСтроки(Новый Структура("ИдентификаторСообщенияНаЭкране", Параметры.ИдентификаторСообщенияНаЭкране));
			
	Если МассивСообщений.Количество() > 0 Тогда		
		НадписьИнформация = СформироватьТекстНадписи(МассивСообщений[0]);
		ЗаполнитьРеквизитыФормы(МассивСообщений[0]);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция СформироватьТекстНадписи(СообщениеДляВывода)
	
	ТекстИнформации = "Дата создания: 	" + ?(ЗначениеЗаполнено(СообщениеДляВывода.ДатаСоздания), СообщениеДляВывода.ДатаСоздания, 		 " не указана...");

	Если Не СообщениеДляВывода.ОтправительМК Тогда
		ТекстИнформации = ТекстИнформации + "
		|Дата отправки: 	" + ?(ЗначениеЗаполнено(СообщениеДляВывода.ДатаОтправки), СообщениеДляВывода.ДатаОтправки, 		 " сообщение не отправлено");		
		
	КонецЕсли;
	ТекстИнформации = ТекстИнформации + "	
	|Дата доставки: 	" + ?(ЗначениеЗаполнено(СообщениеДляВывода.ДатаДоставки), СообщениеДляВывода.ДатаДоставки, 		 " сообщение не получено") + "
	|Дата прочтения: 	" + ?(ЗначениеЗаполнено(СообщениеДляВывода.ДатаПрочтения), СообщениеДляВывода.ДатаПрочтения, 	 " сообщение не прочитано");
	
	Если СообщениеДляВывода.ОтправительМК И СообщениеДляВывода.ПолучательМК Тогда
		ТекстИнформации = ТекстИнформации + "
		|Отправитель и получатель мобильные клиенты";
	ИначеЕсли СообщениеДляВывода.ОтправительМК И Не СообщениеДляВывода.ПолучательМК Тогда
		ТекстИнформации = ТекстИнформации + "
		|Отправитель мобильный клиент, получатель пользователь базы 1С";
		Элементы.ПоказатьНаКарте.Заголовок = "Место создания сообщения";
		Элементы.ПоказатьНаКарте.Видимость = Истина;
	ИначеЕсли Не СообщениеДляВывода.ОтправительМК И СообщениеДляВывода.ПолучательМК Тогда
		ТекстИнформации = ТекстИнформации + "
		|Отправитель пользователь базы 1С, получатель мобильный клиент";
		Элементы.ПоказатьНаКарте.Заголовок = "Место получения и прочтения сообщения";
		Элементы.ПоказатьНаКарте.Видимость = Истина;
	ИначеЕсли Не СообщениеДляВывода.ОтправительМК И Не СообщениеДляВывода.ПолучательМК Тогда
		ТекстИнформации = ТекстИнформации + "
		|Отправитель и получатель пользователи базы 1С";
		Элементы.ПоказатьНаКарте.Видимость = Ложь;
	КонецЕсли;
	
	Если СообщениеДляВывода.Административное Тогда
		ТекстИнформации = ТекстИнформации + "
		|Это административное сообщение";
	КонецЕсли;
		
	Возврат ТекстИнформации;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыФормы(СообщениеДляВывода)
		
	ДатаСоздания = СообщениеДляВывода.ДатаСоздания;
	Сообщение = СообщениеДляВывода.Сообщение;
	Пользователь = СообщениеДляВывода.Пользователь;
	
	//Заполним информацию по сообщению
	Если СообщениеДляВывода.Полученное Тогда
		Кому = ТекущийПользователь;
		ОтКого = СообщениеДляВывода.Пользователь;
	Иначе
		Кому = СообщениеДляВывода.Пользователь;
		ОтКого = ТекущийПользователь;
	КонецЕсли;
	
	ИдентификаторСообщения = СообщениеДляВывода.ИдентификаторСообщения;
	ИдентификаторИнформационнойБазы = СообщениеДляВывода.ИдентификаторИнформационнойБазы;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНаКарте(Команда)
	
	АдресТаблицы = ПолучитьАдресТаблицы();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаПараметровОткрытия", АдресТаблицы);
	ПараметрыФормы.Вставить("НеИнтерактивноеОткрытие", Истина);
	
	ОткрытьФорму("Обработка.атл_ОтображениеТочекСТрекомНаКарте.Форма.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы()
	
	ТаблицаПараметровОткрытия = атл_УправлениеМобильнымиСотрудникамиСервер.СформироватьТаблицуСписокПараметровОткрытияДляОткрытияКарты();
	
	мНоваяСтрока = ТаблицаПараметровОткрытия.Добавить();
	мНоваяСтрока.Пользователь = Пользователь;
	мНоваяСтрока.ВидОбъекта = "Сообщение";
	мНоваяСтрока.Идентификатор = ИдентификаторСообщения;
	мНоваяСтрока.ИдентификаторИнформационнойБазы = ИдентификаторИнформационнойБазы;

	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметровОткрытия, УникальныйИдентификатор);
	
КонецФункции
